export const ar = {
  translation: {
    onboarding: {
      description: "تم تصميمه لمساعدتك في المشاركة والتواصل واستكشاف شغفك",
      get_started: "ابدأ الآن",
    },
    signIn: {
      title: "مرحبًا بعودتك! 🎉",
      description: "تسجيل الدخول للمتابعة",
      signUp: "التسجيل",
      forgotPassword: "نسيت كلمة المرور",
      signIn: "تسجيل الدخول",
      or: "أو المتابعة باستخدام",
      emailPlaceholder: "أدخل بريدك الإلكتروني",
      passwordPlaceholder: "أدخل كلمة المرور",
    },
    signUp: {
      title: "مرحبًا بك في BlueBird",
      description: "سجل للمتابعة",
      signUp: "سجل",
      or: "أو المتابعة باستخدام",
      emailPlaceholder: "أدخل بريدك الإلكتروني",
      passwordPlaceholder: "أدخل كلمة المرور",
      confirmPasswordPlaceholder: "أعد إدخال كلمة المرور",
    },
    forgotPassword: {
      title: "نسيت كلمة المرور؟",
      description: "أدخل بريدك الإلكتروني لإعادة تعيين كلمة المرور",
      emailPlaceholder: "أدخل بريدك الإلكتروني المسجل",
      submit: "إرسال الطلب",
    },
    resetPassword: {
      title: "إعادة تعيين كلمة المرور",
      description:
        "تم إرسال رمز إعادة التعيين إلى بريدك الإلكتروني {{email}}. يرجى إدخال الرمز وإنشاء كلمة مرور جديدة.",
      resetCodePlaceholder: "أدخل رمز إعادة التعيين",
      newPasswordPlaceholder: "أدخل كلمة المرور الجديدة",
      confirmPasswordPlaceholder: "أعد إدخال كلمة المرور الجديدة",
      resetPassword: "إعادة تعيين كلمة المرور",
      resendCode: "إعادة إرسال الرمز",
      resendCodeIn: "إعادة إرسال الرمز بعد {{displayTime}}",
    },
    privacy: {
      title: "بمتابعتك، أنت توافق على",
      terms: "شروط الخدمة",
      privacy: "سياسة الخصوصية",
      content: "سياسة المحتوى",
    },
    validation: {
      email: "البريد الإلكتروني",
      invalidEmail: "عنوان البريد الإلكتروني غير صالح",
      password: "كلمة المرور",
      passwordMatch: "يجب أن تتطابق كلمات المرور",
      passwordRequirement:
        "يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل، وحرف صغير واحد، ورقم واحد",
      required: "مطلوب",
      reset: "رمز إعادة التعيين",
    },
  },
};
