export const hi = {
  translation: {
    onboarding: {
      description:
        "यह आपकी मदद करने के लिए डिज़ाइन किया गया है, ताकि आप अपने शौक को साझा कर सकें, कनेक्ट कर सकें और उनका अन्वेषण कर सकें",
      get_started: "शुरू करें",
    },
    signIn: {
      title: "स्वागत है! 🎉",
      description: "जारी रखने के लिए साइन इन करें",
      signUp: "साइन अप करें",
      forgotPassword: "पासवर्ड भूल गए",
      signIn: "साइन इन करें",
      or: "या के साथ जारी रखें",
      emailPlaceholder: "अपना ईमेल दर्ज करें",
      passwordPlaceholder: "अपना पासवर्ड दर्ज करें",
    },
    signUp: {
      title: "ब्लू बर्ड में स्वागत है",
      description: "जारी रखने के लिए साइन अप करें",
      signUp: "साइन अप करें",
      or: "या के साथ जारी रखें",
      emailPlaceholder: "अपना ईमेल दर्ज करें",
      passwordPlaceholder: "अपना पासवर्ड दर्ज करें",
      confirmPasswordPlaceholder: "अपना पासवर्ड फिर से दर्ज करें",
    },
    forgotPassword: {
      title: "पासवर्ड भूल गए?",
      description: "अपने पासवर्ड को रीसेट करने के लिए अपना ईमेल दर्ज करें",
      emailPlaceholder: "अपना पंजीकृत ईमेल दर्ज करें",
      submit: "अनुरोध भेजें",
    },
    resetPassword: {
      title: "पासवर्ड रीसेट करें",
      description:
        "रीसेट कोड आपके ईमेल {{email}} पर भेजा गया था। कृपया कोड दर्ज करें और नया पासवर्ड सेट करें।",
      resetCodePlaceholder: "अपना रीसेट कोड दर्ज करें",
      newPasswordPlaceholder: "अपना नया पासवर्ड दर्ज करें",
      confirmPasswordPlaceholder: "अपना नया पासवर्ड फिर से दर्ज करें",
      resetPassword: "पासवर्ड रीसेट करें",
      resendCode: "कोड फिर से भेजें",
      resendCodeIn: "कोड फिर से भेजें {{displayTime}} में",
    },
    privacy: {
      title: "जारी रखते हुए, आप हमारी सहमति देते हैं",
      terms: "सेवा की शर्तें",
      privacy: "गोपनीयता नीति",
      content: "सामग्री नीति",
    },
    validation: {
      email: "ईमेल",
      invalidEmail: "अमान्य ईमेल पता",
      password: "पासवर्ड",
      passwordMatch: "पासवर्ड मिलाने चाहिए",
      passwordRequirement:
        "पासवर्ड में कम से कम एक बड़ा अक्षर, एक छोटा अक्षर, और एक संख्या होनी चाहिए",
      required: "आवश्यक है",
      reset: "रीसेट कोड",
    },
  },
};
