export const ru = {
  translation: {
    onboarding: {
      description:
        "Разработано, чтобы помочь вам делиться, общаться и исследовать свои увлечения",
      get_started: "Начать",
    },
    signIn: {
      title: "Добро пожаловать обратно! 🎉",
      description: "Войдите, чтобы продолжить",
      signUp: "Зарегистрироваться",
      forgotPassword: "Забыли пароль",
      signIn: "Войти",
      or: "Или продолжите с",
      emailPlaceholder: "Введите ваш email",
      passwordPlaceholder: "Введите ваш пароль",
    },
    signUp: {
      title: "Добро пожаловать в BlueBird",
      description: "Зарегистрируйтесь, чтобы продолжить",
      signUp: "Зарегистрироваться",
      or: "Или продолжите с",
      emailPlaceholder: "Введите ваш email",
      passwordPlaceholder: "Введите ваш пароль",
      confirmPasswordPlaceholder: "Введите ваш пароль еще раз",
    },
    forgotPassword: {
      title: "Забыли пароль?",
      description: "Введите ваш email, чтобы сбросить пароль",
      emailPlaceholder: "Введите ваш зарегистрированный email",
      submit: "Отправить запрос",
    },
    resetPassword: {
      title: "Сбросить пароль",
      description:
        "Код сброса был отправлен на ваш email {{email}}. Пожалуйста, введите код и создайте новый пароль.",
      resetCodePlaceholder: "Введите код сброса",
      newPasswordPlaceholder: "Введите новый пароль",
      confirmPasswordPlaceholder: "Введите новый пароль еще раз",
      resetPassword: "Сбросить пароль",
      resendCode: "Отправить код снова",
      resendCodeIn: "Отправить код снова через {{displayTime}}",
    },
    privacy: {
      title: "Продолжая, вы соглашаетесь с нашими",
      terms: "Условиями обслуживания",
      privacy: "Политикой конфиденциальности",
      content: "Политикой контента",
    },
    validation: {
      email: "Email",
      invalidEmail: "Неверный email адрес",
      password: "Пароль",
      passwordMatch: "Пароли должны совпадать",
      passwordRequirement:
        "Пароль должен содержать хотя бы одну заглавную букву, одну строчную букву и одну цифру",
      required: "обязательно",
      reset: "Код сброса",
    },
  },
};
